---
title: "Pandas Delete Duplicates"
description: "deleting and dropping duplicates pandas"
tags: Pandas, Data Cleaning / Preprocessing
URL: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html
Licence:

---

# Delete Duplicates in Pandas

In [ ]:
# to drop all duplicate rows
df.drop_duplicates(keep = False)

In [ ]:
# Drop duplicates except for the last occurrence
df.drop_duplicates(['first_name'], keep='last')

In [ ]:
# Drop duplicates except for the first occurrence (keep = 'first' by default)
df.drop_duplicates()

---

## Example

### Import Pandas

In [4]:
import pandas as pd

### Create dataframe with duplicates

In [5]:
raw_data = {'first_name': ['Jason', 'Jason', 'Jason','Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Miller', 'Miller','Ali', 'Milner', 'Cooze'], 
        'age': [42, 42, 1111111, 36, 24, 73], 
        'preTestScore': [4, 4, 4, 31, 2, 3],
        'postTestScore': [25, 25, 25, 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
1      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

### Identify which observations are duplicates

In [6]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

### Drop duplicates

In [8]:
df.drop_duplicates()

  first_name last_name      age  preTestScore  postTestScore
0      Jason    Miller       42             4             25
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70

### Drop duplicates in the first name column, but take the last obs in the duplicated set

In [5]:
df.drop_duplicates(['first_name'], keep='last')

  first_name last_name      age  preTestScore  postTestScore
2      Jason    Miller  1111111             4             25
3       Tina       Ali       36            31             57
4       Jake    Milner       24             2             62
5        Amy     Cooze       73             3             70